Repository: beGateway/wordpress-payment-plugin
Catalog: begateway-payment/languages/begateway-payment-*.po
Languages: ru_ru

source: beGateway Payment Settings
ru_ru: beGateway Payment настройки

source: Plugin Usage
ru_ru: Использование плагина

source: There are a few ways you can use this plugin:
ru_ru: Есть несколько способов, как вы можете использовать этот плагин:

source: Configure the options below and then add the shortcode
ru_ru: Настройте указанные ниже параметры, а затем добавьте shortcode

source: to a post or page
ru_ru: на пост или страницу

source: Call the function from a template file
ru_ru: Вызовите функцию из файла шаблона

source: Use the <strong>beGateway Payment</strong> Widget from the Widgets menu
ru_ru: Используйте <strong>beGateway Payment</strong> виджет из меню виджетов

source: Shortcode Parameters
ru_ru: Параметры шорткодов

source: Optionally, you can add some more parameters in the above mentioned shortcode to customize the currency code, reference title, return page URL, tax etc. Below is a list of the supported parameters in the payment button shortcode
ru_ru: При необходимости можно добавить некоторые дополнительные параметры в упомянутые выше шорткоды для настройки код валюты, заголовка оплаты и др. Ниже приводится список поддерживаемых параметров в шорткоде оплаты

source: Form CSS class
ru_ru: CSS-класс формы

source: Title of proceed to payment button
ru_ru: Текст кнопки оплаты

source: Payment button CSS class
ru_ru: CSS-класс кнопки оплаты

source: Product or service name or the reason for the payment here. The visitors will see this text
ru_ru: Название продукта или услуги или причина для оплаты. Посетители увидят этот текст

source: Set to 1 if you want to show ohter amount text box to your visitors so they can enter custom amount.
ru_ru: Передайте 1, если вы хотите, чтобы показывалось поле для ввода произвольной суммы платежа.

source: Title for the other amount text box. The visitors will see this text.
ru_ru: Заголовок для поля ввода произвольной суммы. Посетители увидят этот текст.

source: Set to 1 if you want your visitors to be able to enter a reference text like email, web address or name.
ru_ru: Передайте 1, если вы хотите, чтобы ваши посетители имели возможность ввести текст описания за что оплата.

source: Title for the Reference text box (ie. your web address). The visitors will see this text.
ru_ru: Заголовок для текстового поля описания оплаты. Посетители увидят этот текст.

source: Payment options to show visitors. Usage sample: Product 1:10.00|Product 2:15.00
ru_ru: Варианты оплаты, чтобы показать посетителям. Пример использования: Продукт 1:10.00|Продукт 2:15.00

source: Set to 1 if you want to show other amount text box to your visitors so they can enter custom amount.
ru_ru: Передайте 1, если вы хотите, чтобы показывалось поле для ввода произвольной суммы платежа.

source: This is your shop id found in your backoffice
ru_ru: Это ваш идентификатор магазина, найденный в вашем личном кабинете поставщика платежных услуг

source: This is your shop secret key found in your backoffice
ru_ru: Это секретный ключ вашего магазина, найденный в вашем личном кабинете поставщика платежных услуг

source: This is payment page domain of your payment service provide
ru_ru: Это домен страницы оплаты поставщика платежных услуг

source: Set to 1 if you want to accept bankcard payments.
ru_ru: Передайте 1, если вы хотите принимать платежи банковскими картами.

source: Set to 1 if you want to accept halva payments.
ru_ru: Установите 1, если хотите принимать карту Халва.

source: Set to 1 if you want to accept erip payments.
ru_ru: Передайте 1, если вы хотите принимать платежи ЕРИП.

source: Your ERIP service code.
ru_ru: Код услуги ЕРИП.

source: Set to 1 if you want your visitors to be required to enter personal name details during payment process.
ru_ru: Передайте 1, если вы хотите, чтобы ваши посетители вводили свое имя во время процесса оплаты.

source: Set to 1 if you want your visitors to be required to enter personal email details during payment process.
ru_ru: Передайте 1, если вы хотите, чтобы ваши посетители вводили свой емэйл во время процесса оплаты.

source: Set to 1 if you want your visitors to be required to enter personal address details during payment process.
ru_ru: Передайте 1, если вы хотите, чтобы ваши посетители вводили свой адрес во время процесса оплаты.

source: Notification URL where beGateway will post messages about processed payments.
ru_ru: URL для уведомлений, куда beGateway будет отправлять сообщения об обработанных платежах

source: Success URL where your customer will be redirected after a successful payment
ru_ru: URL, куда ваш клиент будет перенаправлен после успешной оплаты

source: Decline URL where your customer will be redirected after a payment error
ru_ru: URL, куда ваш клиент будет перенаправлен после ошибки оплаты

source: Fail URL where your customer will be redirected after a failed payment
ru_ru: URL, куда ваш клиент будет перенаправлен после неудачной оплаты

source: Cancel URL where your customer will be redirected when a payment process is cancelled by the customer
ru_ru: URL, куда ваш клиент будет перенаправлен, когда процесс оплаты был отменен вашим клиентом

source: Payment page language. Use two letter code e.g. en for English
ru_ru: Язык страницы оплаты. Используйте двухбуквенный код. Например, для английской en

source: Currency code (USD, EUR and etc) for your visitors to make payments
ru_ru: Код валюты (USD, EUR и т.д.) оплаты

source: Shop Id
ru_ru: Идентификационный номер магазина

source: Shop Key
ru_ru: Ключ магазина

source: Checkout Page Domain
ru_ru: Домен платежной страницы

source: This is payment page domain of your payment service provider
ru_ru: Это домен страницы оплаты поставщика платежных услуг

source: Choose Payment Currency
ru_ru: Выбрать валюту платежа

source: This is the currency for your visitors to make payments
ru_ru: Это валюта, в которой будут осуществляться платежи

source: Payment Subject
ru_ru: Предмет оплаты

source: Enter the Product or service name or the reason for the payment here. The visitors will see this text
ru_ru: Введите описание продукта или услуги, за которые осуществляется оплата. Посетители увидят этот текст.

source: Payment Option
ru_ru: Настройки оплаты

source: Price
ru_ru: Цена

source: Show Other Amount
ru_ru: Показать другую сумму

source: Tick this checkbox if you want to show other amount text box to your visitors so they can enter custom amount.
ru_ru: Отметьте этот флажок, если вы хотите, чтобы показывалось поле для ввода произвольной суммы платежа.

source: Other Amount Title
ru_ru: Заголовок поля ввода произвольной суммы

source: Enter a title for the Other Amount text box. The visitors will see this text.
ru_ru: Введите заголовок для поля ввода произвольной суммы. Посетители увидят этот текст.

source: Enable bankcard
ru_ru: Включение банковской карты

source: Tick this checkbox if you want to accept bankcard payments.
ru_ru: Отметьте этот флажок, если вы хотите принимать платежи банковскими картами.

source: Enable halva
ru_ru: Включить оплату картой Халва

source: Tick this checkbox if you want to accept halva payments.
ru_ru: Отметьте этот флажок, если вы хотите принимать платежи картой Халва.

source: Enable ERIP
ru_ru: Включить оплату через ЕРИП

source: Tick this checkbox if you want to accept ERIP payments.
ru_ru: Отметьте этот флажок, если вы хотите принимать платежи ЕРИП.

source: ERIP service code
ru_ru: Код услуги ЕРИП

source: Enter your ERIP service code.
ru_ru: Введите код услуги ЕРИП.

source: Show Reference Text Box
ru_ru: Показать поле описания оплаты

source: Tick this checkbox if you want your visitors to be able to enter a reference text like email, web address or name.
ru_ru: Отметьте этот флажок, если вы хотите, чтобы ваши посетители имели возможность ввести текст описания за что оплата.

source: Reference Text Box Title
ru_ru: Заголовок для поля описания оплаты

source: Enter a title for the Reference text box (ie. Your Web Address). The visitors will see this text.
ru_ru: Введите заголовок для текстового поля описания оплаты. Посетители увидят этот текст.

source: Require Visitor Personal Details
ru_ru: Требуются личные данные посетителя

source: Tick this checkbox if you want your visitors to be required to enter personal details (name, address and etc) during payment process.
ru_ru: Отметьте этот флажок, если вы хотите, чтобы ваши посетители вводили личные данные (имя, адрес и т.д.) во время процесса оплаты.

source: Require Visitor Name
ru_ru: Требовать имя во время оплаты

source: Tick this checkbox if you want your visitors to be required to enter personal name during payment process.
ru_ru: Отметьте этот флажок, если вы хотите, чтобы ваши посетители вводили свое имя во время процесса оплаты.

source: Require Visitor Email
ru_ru: Требовать емэйл во время оплаты

source: Tick this checkbox if you want your visitors to be required to enter email during payment process.
ru_ru: Отметьте этот флажок, если вы хотите, чтобы ваши посетители вводили свой емэйл во время процесса оплаты.

source: Require Visitor Address Details
ru_ru: Требовать адрес во время оплаты

source: Tick this checkbox if you want your visitors to be required to enter address details during payment process.
ru_ru: Отметьте этот флажок, если вы хотите, чтобы ваши посетители вводили свой адрес во время процесса оплаты.

source: Notification URL
ru_ru: URL для уведомлений

source: Optional Notification URL where beGateway will post messages about processed payments
ru_ru: Необязательный URL для уведомлений, куда beGateway будет отправлять сообщения об обработанных платежей

source: Success URL
ru_ru: URL для успешной оплаты

source: Decline URL
ru_ru: URL для ошибки оплаты

source: Fail URL
ru_ru: URL для неудачной оплаты

source: Cancel URL
ru_ru: URL для отмены

source: Test mode
ru_ru: Тестовый режим

source: Tick this checkbox to enable test mode
ru_ru: Отметьте этот флажок, чтобы включить режим тестирования

source: Save Changes
ru_ru: Сохранить изменения

source: Pay
ru_ru: Оплатить

source: No Description
ru_ru: Нет описания

source: Error to acquire a payment token
ru_ru: Ошибка получения токена на оплату

source: Widget beGateway Payment
ru_ru: Виджет beGateway Payment

source: Title
ru_ru: Заголовок

source: Place the plugin shortcode at any of your pages and start to accept payments in WordPress instantly
ru_ru: Поместите шорткод плагина на любую страницу и начните принимать оплату в WordPress
